Repository: hforge/Localizer
Catalog: locale/*.po
Languages: es, fr

source: Add
es: Añadir
fr: Ajouter

source: Default
es: Por defecto
fr: Défaut

source: Delete
es: Eliminar
fr: Effacer

source: Change
es: Cambiar
fr: Modifier

source: To add a language select it and click the <tt>Add</tt> button.
es: Para añadir un idioma seleccionalo y pulsa el botón <tt>Añadir</tt>.
fr: Pour ajouter une langue, sélectionnez la et cliquer sur le bouton <tt>Add</tt> .

source: To delete a language check it and click the <tt>Delete</tt> button. To change the default language select it and click the <tt>Change</tt> button.
es: Para eliminar un idioma selecciónalo y pulsa el botón <tt>Eliminar</tt>. Para cambiar el idioma por defecto selecciónalo y pulsa el botón <tt>Cambiar</tt>.
fr: Pour supprimer un langage, sélectionnez le et cliquer le bouton <tt>Delete</tt> . Pour modifier le language de défault, sélectionnez le et cliquez le bouton <tt>Change</tt> .

source: There aren't languages
es: No hay idiomas.
fr: Il n'y a pas de langue

source: Name
es: Nombre
fr: Nom

source: Type
es: Tipo

source: Hide this language
es: Ocultar este idioma
fr: Cacher cette langue

source: Show this language
es: Mostrar este idioma
fr: Afficher cette langue

source: Save changes
es: Guardar cambios
fr: Sauvegarder les modifications

source: To add a new property enter its name, select its type and click the <tt>Add</tt> button.
es: Para añadir una nueva propiedad introduce su nombre, selecciona su tipo y pulsa el botón <tt>Añadir</tt>.
fr: Pour ajouter une nouvelle propriété, saisissez son nom, choisissez son type et cliquez sur le bouton <tt>Add</tt>.

source: There aren't properties.
es: No hay propiedades.
fr: Il n'y a pas de propriétés

source: This <tt>%s</tt> object needs to be upgraded
es: Este objeto <tt>%s</tt> necesita ser actualizado
fr: Cet objet <tt>%s</tt> requière une mise à niveau.

source: Upgrade
es: Actualizar
fr: Mise à niveau

source: This object don't needs to be upgraded.
es: Este objeto no necesita ser actualizado.
fr: Cet objet n'a pas besoin de mise à niveau.

source: Add Local Content
es: Añadir contenido localizado
fr: Ajouter du contenu local

source: Languages
es: Idiomas
fr: Langues

source: A Local Content object provides an storage for multilingual (and non multilingual) properties. It also helps to keep your content separated from the logic and the presentation.
es: Un objeto <em>Local Content</em> proporciona un medio para almacenar propiedades multilingües (y monolingües). También ayuda a mantener el contenido separado de la lógica y la presentación.
fr: Un Objet de contenu local permet de sauvegarder des propriétées multilingues (ou unique). Il permet également de séparer le contenu de la présentation et de la logique de l'application.

source: Add Local Folder
es: Añadir carpeta local
fr: Ajouter un répertoire de langue

source: Title
es: Título
fr: Titre

source: A local folder is a generic solution to manage any kind of multingual objects, files, images, scripts, etc..
es: Una carpeta local es una solución genérica para gestionar cualquier tipo de objetos multilingües, ficheros, imágenes, guiones de código, etc..

source: To delete an attribute check it and click the <tt>Delete</tt> button.
es: Para eliminar un atributo seleccionalo y pulsa el botón <tt>Eliminar</tt>.

source: There aren't attributes
es: No hay atributos.

source: To add an attribute introduce its id and click the <tt>Add</tt> button.
es: Para añadir un atributo introduce su id y pulsa el botón <tt>Añadir</tt>.

source: Add Localizer
es: Añadir <em>Localizer</em>
fr: Ajouter une instance "Localizer"

source: Use locale folders
es: Usar carpetas locales
fr: Utiliser le répertoire local

source: Locale folders are useful to store special multilingual objects like images and specific logic. If used the <tt>Localizer</tt> object will transparently add the right locale folder to the url. If you want to use locale folders check the checkbox, otherwise uncheck it, then click the <tt>Change</tt> button.
es: Las carpetas locales son útiles para almacenar objetos multilingües especiales como imágenes y lógica específica. Si se usan el objeto <tt>Localizer</tt> de forma transparente añadirá la carpeta local correcta a la <em>url</em>. Si quieres usar las carpetas locales selecciona el cuadro de selección, si no deseleccionalo, entonces pulsa en botón <tt>Cambiar</tt>.
fr: Les répertoires de langue sont utiles pour sauvegarder des objets multilingues speciaux commes des images et leur logique spécifique. Lorsqu'il est utilisé, l'objet <tt>Localizer</tt> va automatiquement ajouter le Répertoire de langue approprié à l'url. Si vous voulez utiliser un répertoire de langue spécifique, le sélectioner puis activé les modifications en cliquant sur le bouton <tt>Change</tt>.

source: This <tt>Localizer</tt> object needs to be upgraded.
es: Este objeto <tt>Localizer</tt> debe ser actualizado
fr: Cet objet <tt>Localizer</tt> a besoin d'une mise à niveau.

source: This <tt>Localizer</tt> object don't needs to be upgraded.
es: Este objeto <tt>Localizer</tt> no necesita actualizarse
fr: Cet objet <tt>Localizer</tt> ne requière pas de mise à niveau.

source: Add Message Catalog
es: Añadir un catálogo de mensajes
fr: Ajouter un Message Catalog

source: A message catalog stores messages and its translations to different languages. It provides the <tt>gettext</tt> method to get the right translation for a given message. Message catalogs are useful to translate the application interfaces (labels, buttons, etc..).
es: Un catálogo de mensajes almacena mensajes y sus traducciones a diferentes idiomas. Proporciona el método <tt>gettext</tt> para obtener la traducción correcta en un idioma dado. Los catálogos de mensajes son útiles para traducir las interfaces de la aplicación (etiquetas, botones, etc..).
fr: Un message catalog stocke les messages et leurs traductions. Il fournit la méthode <tt>gettext</tt> afin d'obtenir la bonne traduction pour un message donné. Les message catalogs sont utiles pour traduire les interfaces des applications (titres, boutons, etc.).

source: File / Language
es: Fichero / Idioma
fr: Fichier / Langue

source: Export
es: Exportar
fr: Exporter

source: File
es: Fichero
fr: Fichier

source: Language
es: Idioma
fr: Langue

source: Import
es: Importar
fr: Importer

source: You can export the messages and their translations to PO files. Check <tt>locale.pot</tt> to get only the messages, without their translations. Check any other option to get a PO file with the messages and their translations to the selected language. Then click the <tt>Export</tt> button.
es: Puedes exportar los mensajes y sus traducciones a ficheros PO. Selecciona <tt>locale.pot</tt> para obtener tan solo los mensajes, sin sus traducciones. Selecciona cualquier otra opción para obtener un fichero PO con los mensajes y sus traducciones al idioma seleccionado. Entonces pulsa el botón <tt>Exportar</tt>.
fr: Vous pouvez exporter des messages et leurs traductions dans des fichiers de type "PO". Sélectionnez <tt>locale.pot</tt> pour exporter les messages sans traductions. Sélectionnez tout autre options pour générer un fichier "PO" avec ses messages et leurs traductions dans le langage sélectioné. Ensuite cliquez sur le bouton <tt>Export</tt>.

source: You can add new messages and translations importing a PO file. Enter the filename, select the language of the translations and click the <tt>Import</tt> button.
es: Puedes añadir nuevos mensajes y traducciones importando ficheros PO. Introduce el nombre del fichero, selecciona el idioma de las traducciones y pulsa el botón <tt>Importar</tt>.
fr: Vous pouvez ajouter de nouveau messages et traductions en important un fichier de type "PO". Saisissez le nom de fichier, sélectionnez la langue de traduction et cliquez sur le bouton <tt>Import</tt> .

source: Save
es: Guardar

source: Only untranslated messages
es: Solamente mensajes sin traducción

source: Filter
es: Filtrar
fr: Filtrer

source: Results %d-%d of %d
es: Resultados %d-%d de %d
fr: Résutats %d-%d de %d

source: There aren't messages.
es: No hay mensajes.
fr: Il n'y a pas de message

source: Your name
es: Tu nombre
fr: Votre nom

source: Your e-mail address
es: Tu dirección de <em>email</em>
fr: Votre adresse email

source: Team e-mail address
es: Dirección de <em>email</em> del equipo
fr: Adresse email de l'équipe

source: Charset
es: Conjunto de caracteres
fr: Type de caractères

source: With this form you can change the title of the message catalog. The title also is used as the value of the <tt>Project-Id-Version</tt> field in the header of the PO files, which are generated when the message catalog is exported.
es: Con este formulario puedes cambiar el título del catálogo de mensajes. El título también se utiliza como valor del campo <tt>Project-Id-Version</tt> en la cabecera de los ficheros PO, los cuales se generan cuando se exporta el catálogo de mensajes.
fr: À l'aide de ce formulaire vous pouvez modifier le titre du message catalog. Le titre est également utilisé comme valeur du champ <tt>Project-Id-Version</tt>dans l'entête des fichiers PO. Ces derniers sont créés quand le message catalog est exporté.

source: Besides the title the header of a PO file stores more information, the name and the email address of the last translator, the email adress of the translation team and the charset. The forms below let to modify this information for each language.
es: Además del título las cabeceras de los ficheros PO almacenan más información, el nombre y la dirección de correo electrónico del último traductor, la dirección de correo electrónico del equipo de traducción y el conjunto de caracteres. Los formularios que hay abajo permiten modificar esta información para cada idioma.
fr: En plus du titre, l'entête d'un fichier PO stocke d'autres informations : le nom et l'adresse email du dernier traducteur, l'adresse email de l'équipe de traduction et le type de caractères. Le formulaire situé en dessous permet de modifier ces information pour chaque langue.

source: Attributes
es: Atributos

source: Local properties
es: Propiedades locales
fr: Propriétées locales

source: Saved changes.
es: Cambios guardados.

source: Messages
es: Mensajes

source: Properties
es: Propiedades
fr: Propriétés

source: Import/Export
es: Importar/Exportar
fr: Importer/Exporter

source: Contents
es: Contenido
fr: Contenu

source: View
es: Ver
fr: Visualiser

source: Security
es: Seguridad
fr: Sécurité

source: Undo
es: Deshacer
fr: Annuler

source: Ownership
es: Propiedad
fr: Propriétaire

source: Find
es: Buscar
fr: Recherche

source: Spanish
es: Español

source: French
fr: Français
